const cityProvince = ["辽宁", "吉林", "黑龙江", "河北", "山西", "陕西", "甘肃", "青海", "山东", "安徽", "江苏", "浙江", "河南", "湖北", "湖南", "江西", "台湾", "福建", "云南", "海南", "四川", "贵州", "广东", "内蒙古", "新疆", "广西", "西藏", "宁夏", " 北京", "上海", "天津", "重庆", "香港", "澳门"];

const areaCounty = {
    '北京': ["东城区", "西城区", "崇文区", "宣武区", "朝阳区", "丰台区", "石景山区", "海淀区", "门头沟区", "房山区", "通州区", "顺义区", "昌平区", "大兴区", "怀柔区", "平谷区", "密云县", "延庆县"],
    '上海': ["黄浦区", "卢湾区", "徐汇区", "徐家汇", "长宁区", "静安区", "普陀区", "闸北区虹口区", "杨浦区", "宝山区", "闵行区", "嘉定区", "浦东新区", "松江区", "金山区", "青浦区", "南汇区", "奉贤区", "崇明县"],
    '天津': ["和平区", "河东区", "河西区", "南开区", "河北区", "红桥区", "塘沽区", "汉沽区", "大港区", "东丽区", "西青区", "北辰区", "津南区", "武清区", "宝坻区", "静海县", "宁河县"],
    '重庆': ["渝中区", "大渡口区", "江北区", "沙坪坝区", "九龙坡区", "南岸区", "北碚区", "万盛区", "双桥区", "渝北区", "巴南区", "万州区", "涪陵区", "黔江区", "长寿区", "永川市", "合川市", "江津市", "南川市", "綦江县", "潼南县", "荣昌县", "璧山县", "大足县", "铜梁县", "梁平县", "城口县", "垫江县", "武隆县", "丰都县", "奉节县", "开县", "云阳县", "忠县", "巫溪县", "巫山县", "石柱县", "秀山县", "酉阳县", "彭水县"],
    '河北省': {
        city: [],
        children: {
            
        }
    }

}